Revit 2026 API

# ToggleButtonData(String, String, String, String) Constructor

---

Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ToggleButtonData(
	string name,
	string text,
	string assemblyName,
	string className
)
```
```vb
Public Sub New (
	name As String,
	text As String,
	assemblyName As String,
	className As String
)
```
```cpp
public:
ToggleButtonData(
	String^ name,
	String^ text,
	String^ assemblyName,
	String^ className
)
```
```fsharp
new :
        name : string *
        text : string *
        assemblyName : string *
        className : string -> ToggleButtonData
```

#### Parameters

name String
    The internal name of the new button.
text String
    The user visible text seen on the new button.
assemblyName String
    The assembly path of the button.
className String
    The name of the class containing the implementation for the command.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for one or more arguments. |
| ArgumentException | Thrown when an empty string is passed for one or more arguments. |

#### Reference

ToggleButtonData Class

ToggleButtonData Overload

Autodesk.Revit.UI Namespace